clc, clear
%rng('shuffle')  %根据当前时间为随机数生成器提供种子
rng(0) %进行一致性比较，每次产生的随机数是一样的
p0=0; n=10^6; tic    %计时开始
for i=1:n
   x=randi([0,99],1,5); %产生一行五列的区间[0,99]上的随机整数
   [f,g]=mengte(x);
   if all(g<=0)
       if p0<f
           x0=x; p0=f; %记录下当前较好的解
       end
   end
end
x0, p0, toc    %计时结束
function [f,g]=mengte(x);  %定义目标函数和约束条件
f=x(1)^2+x(2)^2+3*x(3)^2+4*x(4)^2+2*x(5)-8*x(1)-2*x(2)-3*x(3)-...
x(4)-2*x(5);
g=[sum(x)-400
x(1)+2*x(2)+2*x(3)+x(4)+6*x(5)-800
2*x(1)+x(2)+6*x(3)-200
x(3)+x(4)+5*x(5)-200];
end       
